

DYNAMIC
============
	
+При выборе “Создать игровую комнату” должна быть возможность создать комнату и получить ссылку для приглашения соперника 
+При выборе “Присоединиться к игре по ссылке” должна быть возможность вставить ссылку и попасть в игровую комнату
+При выборе “Рейтинг игроков” должно появиться окошко с топ 10 игроками и в конце должен отображаться ваш рейтинг (не обязательно, но желательно)
-Количество очков вычисляется от количества побед (1 победа – 5 очков)

-При двойном клике (либо при нажатии какой-нибудь клавиши) должно появиться окно, 
где можно обменять пешку на слона, ладью, коня либо на ферзя. Обмен осуществляется при наличии очков достаточных для обмена. 
•	Слон и конь – 10 очков
•	Ладья – 15 очков 
•	Ферзь – 30 очков
•	Можно поменять только 4 фигуры 
-Игра начинается по готовности игроков



						
						
					
